Tekla.Structures.Model.Position.RotationEnum
The position in the rotational sense.

Tekla.Structures.Model.Position.RotationEnum.FRONT
The front option.

Tekla.Structures.Model.Position.RotationEnum.TOP
The top option.

Tekla.Structures.Model.Position.RotationEnum.BACK
The back option.

Tekla.Structures.Model.Position.RotationEnum.BELOW
The below option.